# Documents (Reimplementation)

#### https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html

In [1]:
import pandas as pd
import numpy as np

# 001. pandas.DataFrame.index

#### Constructing DataFrame from a dictionary

In [6]:
d = {'col1':[1,2], 'col2':[3,4]}
df = pd.DataFrame(data=d)
df

   col1  col2
0     1     3
1     2     4

In [7]:
df.dtypes

col1    int64
col2    int64
dtype: object

#### To enforce a single dtype

In [8]:
df = pd.DataFrame(data=d, dtype=np.int8)
df.dtypes

col1    int8
col2    int8
dtype: object

#### Constructing DataFrame from numpy ndarray

In [11]:
df2 = pd.DataFrame(np.array([[1,2,3,],[4,5,6],[7,8,9]]),
                   columns=['a','b','c'])
df2

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

# 002. pandas.DataFrame.T

In [12]:
d1 = {'col1':[1,2], 'col2':[3,4]}
df1 = pd.DataFrame(data=d1)
df1

   col1  col2
0     1     3
1     2     4

In [13]:
df1_transposed = df1.T
df1_transposed

      0  1
col1  1  2
col2  3  4

In [14]:
df1.transpose()

      0  1
col1  1  2
col2  3  4

In [15]:
df1.dtypes

col1    int64
col2    int64
dtype: object

In [16]:
df1_transposed.dtypes

0    int64
1    int64
dtype: object

#### Non-square DataFrame with mixed dtypes

In [17]:
d2 = {'name':['Alice','Bob'],
      'score':[9.5,8],
      'employed': [False, True],
      'kids': [0,0]}
df2 = pd.DataFrame(data=d2)
df2

    name  score  employed  kids
0  Alice    9.5     False     0
1    Bob    8.0      True     0

In [18]:
df2_transposed = df2.T
df2_transposed

              0     1
name      Alice   Bob
score       9.5     8
employed  False  True
kids          0     0

In [19]:
df2.dtypes

name         object
score       float64
employed       bool
kids          int64
dtype: object

In [20]:
df2_transposed.dtypes

0    object
1    object
dtype: object

# 003. pandas.DataFrame.at

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.at.html

In [6]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame([[0,2,3],[0,4,1],[10,20,30]],
                  index=[4,5,6], columns=['A','B','C'])
df

    A   B   C
4   0   2   3
5   0   4   1
6  10  20  30

In [3]:
df.at[4,'B']

2

In [4]:
df.at[4,'B'] = 10
df.at[4,'B']

10

In [5]:
df.loc[5].at['B']

4

# 004. pandas.DataFrame.axes

In [7]:
df = pd.DataFrame({'col1':[1,2], 'col2':[3,4]})
df

   col1  col2
0     1     3
1     2     4

In [8]:
df.axes

[RangeIndex(start=0, stop=2, step=1), Index(['col1', 'col2'], dtype='object')]

In [10]:
df.axes[0]

RangeIndex(start=0, stop=2, step=1)

In [11]:
df.axes[1]

Index(['col1', 'col2'], dtype='object')

# 005. pandas.DataFrame.columns

In [13]:
df = pd.DataFrame({'col1':[1,2], 'col2':[3,4]})
df

   col1  col2
0     1     3
1     2     4

In [14]:
df.columns

Index(['col1', 'col2'], dtype='object')

# 006. pandas.DataFrame.dtypes

In [15]:
df = pd.DataFrame({'float' : [1.0],
                   'int' : [1],
                   'datetime' : [pd.Timestamp('20200101')],
                   'string' : ['foo']})
df

   float  int   datetime string
0    1.0    1 2020-01-01    foo

In [17]:
df.dtypes

float              float64
int                  int64
datetime    datetime64[ns]
string              object
dtype: object

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dtypes.html

# 007. pandas.DataFrame.empty

In [2]:
df_empty = pd.DataFrame({'A':[]})
df_empty

Empty DataFrame
Columns: [A]
Index: []

In [3]:
df_empty.empty

True

In [6]:
import numpy as np
df = pd.DataFrame({'A':[np.nan]})
df

    A
0 NaN

In [7]:
df.empty

False

In [8]:
df.dropna().empty

True

# 008. pandas.DataFrame.iat

In [9]:
df = pd.DataFrame([[0,2,3],[0,4,1],[10,20,30]],
                  columns=['A','B','C'])
df

    A   B   C
0   0   2   3
1   0   4   1
2  10  20  30

In [10]:
df.iat[1,2]

1

In [11]:
df.iat[1,2] = 10
df.iat[1,2]

10

In [12]:
df.loc[0].iat[1]

2

# 009. pandas.DataFrame.iloc

In [13]:
mydict = [{'a':1, 'b':2, 'c':3, 'd':4},
          {'a':100, 'b':200, 'c':300, 'd':400},
          {'a':1000, 'b':2000, 'c':3000, 'd':4000}]
df = pd.DataFrame(mydict)
df

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [14]:
type(df.iloc[0])

pandas.core.series.Series

In [17]:
df.iloc[0]   # Series

a    1
b    2
c    3
d    4
Name: 0, dtype: int64

In [18]:
df.iloc[[0]]

   a  b  c  d
0  1  2  3  4

In [19]:
df.iloc[[0,1]]

     a    b    c    d
0    1    2    3    4
1  100  200  300  400

In [20]:
df.iloc[:3]

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [22]:
df.iloc[[True,False,True]]

      a     b     c     d
0     1     2     3     4
2  1000  2000  3000  4000

In [25]:
df.iloc[lambda x: x.index % 2 ==0]

      a     b     c     d
0     1     2     3     4
2  1000  2000  3000  4000

In [26]:
df.iloc[0,1]

2

In [27]:
df.iloc[[0,2],[1,3]]

      b     d
0     2     4
2  2000  4000

In [28]:
df.iloc[1:3, 0:3]

      a     b     c
1   100   200   300
2  1000  2000  3000

In [29]:
df.iloc[:, [True, False, True, False]]

      a     c
0     1     3
1   100   300
2  1000  3000

In [30]:
df.iloc[:, lambda df: [0,2]]

      a     c
0     1     3
1   100   300
2  1000  3000

# 010. pandas.DataFrame.loc

In [31]:
df = pd.DataFrame([[1,2],[4,5],[7,8]],
                  index=['cobra', 'viper', 'sidewinder'],
                  columns=['max_speed', 'shield'])
df

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [32]:
df.loc['viper']

max_speed    4
shield       5
Name: viper, dtype: int64

In [33]:
df.loc[['viper','sidewinder']]

            max_speed  shield
viper               4       5
sidewinder          7       8

In [34]:
df.loc['cobra','shield']

2

In [35]:
df.loc['cobra':'viper', 'max_speed']

cobra    1
viper    4
Name: max_speed, dtype: int64

In [36]:
df.loc[[False, False, True]]

            max_speed  shield
sidewinder          7       8

In [37]:
df.loc[df['shield']>6]

            max_speed  shield
sidewinder          7       8

In [38]:
df.loc[df['shield']>6, ['max_speed']]

            max_speed
sidewinder          7

In [39]:
df.loc[lambda df: df['shield']==8]

            max_speed  shield
sidewinder          7       8

In [40]:
df.loc[['viper', 'sidewinder'], ['shield']] = 50
df

            max_speed  shield
cobra               1       2
viper               4      50
sidewinder          7      50

In [41]:
df.loc['cobra'] = 10
df

            max_speed  shield
cobra              10      10
viper               4      50
sidewinder          7      50

In [42]:
df.loc[:, 'max_speed'] = 30
df

            max_speed  shield
cobra              30      10
viper              30      50
sidewinder         30      50

In [44]:
df.loc[df['shield']>35] = 0
df

            max_speed  shield
cobra              30      10
viper               0       0
sidewinder          0       0

#### DF indexing with 'Integer labels'

In [45]:
df = pd.DataFrame([[1,2],[4,5],[7,8]],
                  index=[7,8,9],
                  columns=['max_speed', 'shield'])
df

   max_speed  shield
7          1       2
8          4       5
9          7       8

In [46]:
df.loc[7:9]

   max_speed  shield
7          1       2
8          4       5
9          7       8

#### getting values with a multi-index

In [47]:
tuples = [
    ('cobra', 'mark i'), ('cobra', 'mark ii'),
    ('sidewinder', 'mark i'), ('sidewinder', 'mark ii'),
    ('viper', 'mark ii'), ('viper', 'mark iii')
]
index = pd.MultiIndex.from_tuples(tuples)
values = [[12,2],[0,4],[10,20],
          [1,4],[7,1],[16,36]]
df = pd.DataFrame(values, columns=['max_speed','shield'], index=index)
df

                     max_speed  shield
cobra      mark i           12       2
           mark ii           0       4
sidewinder mark i           10      20
           mark ii           1       4
viper      mark ii           7       1
           mark iii         16      36

In [48]:
df.loc['cobra']

         max_speed  shield
mark i          12       2
mark ii          0       4

In [49]:
df.loc[('cobra', 'mark ii')]

max_speed    0
shield       4
Name: (cobra, mark ii), dtype: int64

In [50]:
df.loc['cobra','mark i']

max_speed    12
shield        2
Name: (cobra, mark i), dtype: int64

In [51]:
df.loc[('cobra','mark i'), 'shield']

2

In [52]:
df.loc[('cobra', 'mark i') : 'viper']

                     max_speed  shield
cobra      mark i           12       2
           mark ii           0       4
sidewinder mark i           10      20
           mark ii           1       4
viper      mark ii           7       1
           mark iii         16      36

In [53]:
df.loc[('cobra','mark i') : ('viper','mark ii')]

                    max_speed  shield
cobra      mark i          12       2
           mark ii          0       4
sidewinder mark i          10      20
           mark ii          1       4
viper      mark ii          7       1

# 011. pandas.DataFrame.ndim

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.ndim.html

In [2]:
s = pd.Series({'a':1, 'b':2, 'c':3})
s

a    1
b    2
c    3
dtype: int64

In [3]:
s.ndim

1

In [4]:
df = pd.DataFrame({'col1':[1,2], 'col2':[3,4]})
df

   col1  col2
0     1     3
1     2     4

In [5]:
df.ndim

2

# 012. pandas.DataFrame.shape

In [6]:
df = pd.DataFrame({'col1':[1,2], 'col2':[3,4]})
df

   col1  col2
0     1     3
1     2     4

In [7]:
df.shape

(2, 2)

In [8]:
df = pd.DataFrame({'col1':[1,2], 'col2':[3,4], 'col3':[5,6]})
df

   col1  col2  col3
0     1     3     5
1     2     4     6

In [9]:
df.shape

(2, 3)

# 013. pandas.DataFrame.size

In [12]:
s = pd.Series({'a':1, 'b':2, 'c':3})
s

a    1
b    2
c    3
dtype: int64

In [13]:
s.size

3

In [16]:
df = pd.DataFrame({'col1':[1,2], 'col2':[3,4]})
df

   col1  col2
0     1     3
1     2     4

In [15]:
df.size

4

# 014. pandas.DataFrame.values

In [17]:
df = pd.DataFrame({'age' : [3,29],
                   'height' : [94,170],
                   'weight' : [31,115]})
df

   age  height  weight
0    3      94      31
1   29     170     115

In [18]:
df.dtypes

age       int64
height    int64
weight    int64
dtype: object

In [19]:
df.values

array([[  3,  94,  31],
       [ 29, 170, 115]], dtype=int64)

In [21]:
df2 = pd.DataFrame([('parrot', 24.0, 'second'),
                    ('lion', 80.5, 1),
                    ('monkey', np.nan, None)],
                    columns=('name','max_speed','rank'))
df2

     name  max_speed    rank
0  parrot       24.0  second
1    lion       80.5       1
2  monkey        NaN    None

In [22]:
df2.dtypes

name          object
max_speed    float64
rank          object
dtype: object

In [23]:
df2.values

array([['parrot', 24.0, 'second'],
       ['lion', 80.5, 1],
       ['monkey', nan, None]], dtype=object)

# 015. pandas.DataFrame.abs

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.abs.html

In [3]:
s = pd.Series([-1,10,2,-3.33,4])
s

0    -1.00
1    10.00
2     2.00
3    -3.33
4     4.00
dtype: float64

In [4]:
s.abs()

0     1.00
1    10.00
2     2.00
3     3.33
4     4.00
dtype: float64

In [5]:
s = pd.Series([1.2+1j])
s

0    1.200000+1.000000j
dtype: complex128

In [6]:
s.abs()

0    1.56205
dtype: float64

In [7]:
s = pd.Series([pd.Timedelta('1 days')])
s

0   1 days
dtype: timedelta64[ns]

In [8]:
s.abs()

0   1 days
dtype: timedelta64[ns]

In [9]:
df = pd.DataFrame({
    'a':[4,5,6,7],
    'b':[10,20,30,40],
    'c':[100,50,-30,-50]
})
df

   a   b    c
0  4  10  100
1  5  20   50
2  6  30  -30
3  7  40  -50

In [10]:
df.loc[(df.c - 43).abs().argsort()]

   a   b    c
1  5  20   50
0  4  10  100
2  6  30  -30
3  7  40  -50

# 016. Pandas.DataFrame.abs

In [3]:
df = pd.DataFrame({'angles':[0,3,4],
                   'degrees':[360,180,360]},
                   index = ['circle', 'triangle', 'rectangle'])
df

           angles  degrees
circle          0      360
triangle        3      180
rectangle       4      360

In [4]:
df + 1

           angles  degrees
circle          1      361
triangle        4      181
rectangle       5      361

In [5]:
df.add(1)

           angles  degrees
circle          1      361
triangle        4      181
rectangle       5      361

In [6]:
df.div(10)

           angles  degrees
circle        0.0     36.0
triangle      0.3     18.0
rectangle     0.4     36.0

In [7]:
df.rdiv(10)

             angles   degrees
circle          inf  0.027778
triangle   3.333333  0.055556
rectangle  2.500000  0.027778

In [8]:
df - [1,2]

           angles  degrees
circle         -1      358
triangle        2      178
rectangle       3      358

In [9]:
df.sub([1,2], axis='columns')

           angles  degrees
circle         -1      358
triangle        2      178
rectangle       3      358

In [11]:
df.sub(pd.Series([1,1,1],
                 index=['circle','triangle','rectangle']),
                 axis='index')

           angles  degrees
circle         -1      359
triangle        2      179
rectangle       3      359

In [12]:
other = pd.DataFrame({'angles':[0,3,4]},
                     index=['circle','triangle','rectangle'])
other

           angles
circle          0
triangle        3
rectangle       4

In [13]:
df * other

           angles  degrees
circle          0      NaN
triangle        9      NaN
rectangle      16      NaN

In [14]:
df.mul(other, fill_value=0)

           angles  degrees
circle          0      0.0
triangle        9      0.0
rectangle      16      0.0

In [15]:
df_multindex = pd.DataFrame({'angles':[0,3,4,4,5,6],
                             'degrees':[360,180,360,360,540,720]},
                            index = [['A','A','A','B','B','B'],
                                     ['circle','triangle','rectangle',
                                      'square','pentagon','hexagon']])
df_multindex

             angles  degrees
A circle          0      360
  triangle        3      180
  rectangle       4      360
B square          4      360
  pentagon        5      540
  hexagon         6      720

In [17]:
df.div(df_multindex, level=1, fill_value=0)

             angles  degrees
A circle        NaN      1.0
  triangle      1.0      1.0
  rectangle     1.0      1.0
B square        0.0      0.0
  pentagon      0.0      0.0
  hexagon       0.0      0.0

# 017. Pandas.DataFrame.add_prefix
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.add_prefix.html

In [3]:
s = pd.Series([1,2,3,4])
s

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
s.add_prefix('item_')

item_0    1
item_1    2
item_2    3
item_3    4
dtype: int64

In [5]:
df = pd.DataFrame({'A':[1,2,3,4],
                   'B':[3,4,5,6]})
df

   A  B
0  1  3
1  2  4
2  3  5
3  4  6

In [6]:
df.add_prefix('col_')

   col_A  col_B
0      1      3
1      2      4
2      3      5
3      4      6

# 018. pandas.DataFrame.add_suffix

In [7]:
s = pd.Series([1,2,3,4])
s

0    1
1    2
2    3
3    4
dtype: int64

In [8]:
s.add_suffix('_item')

0_item    1
1_item    2
2_item    3
3_item    4
dtype: int64

In [11]:
df = pd.DataFrame({'A':[1,2,3,4],
                   'B':[3,4,5,6]})
df

   A  B
0  1  3
1  2  4
2  3  5
3  4  6

In [13]:
df.add_suffix('_col')

   A_col  B_col
0      1      3
1      2      4
2      3      5
3      4      6

# 019. pandas.DataFrame.agg
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.agg.html

In [3]:
df = pd.DataFrame([[1,2,3],
                   [4,5,6],
                   [7,8,9],
                   [np.nan, np.nan, np.nan]],
                   columns = ['A','B','C'])
df

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  6.0
2  7.0  8.0  9.0
3  NaN  NaN  NaN

In [4]:
df.agg(['sum','min'])

        A     B     C
sum  12.0  15.0  18.0
min   1.0   2.0   3.0

In [5]:
df.agg({'A':['sum','min'],
        'B':['min','max']})

        A    B
max   NaN  8.0
min   1.0  2.0
sum  12.0  NaN

In [6]:
df.agg('mean', axis='columns')

0    2.0
1    5.0
2    8.0
3    NaN
dtype: float64

# 020. pandas.DataFrame.aggregate

In [7]:
df = pd.DataFrame([[1,2,3],
                   [4,5,6],
                   [7,8,9],
                   [np.nan, np.nan, np.nan]],
                  columns = ['A', 'B', 'C'])
df

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  6.0
2  7.0  8.0  9.0
3  NaN  NaN  NaN

In [8]:
df.agg(['sum','min'])

        A     B     C
sum  12.0  15.0  18.0
min   1.0   2.0   3.0

In [9]:
df.agg({'A':['sum','min'],
        'B':['min','max']})

        A    B
max   NaN  8.0
min   1.0  2.0
sum  12.0  NaN

In [10]:
df.agg("mean", axis="columns")

0    2.0
1    5.0
2    8.0
3    NaN
dtype: float64

# 021. pandas.DataFrame.all

In [11]:
pd.Series([True,True]).all()

True

In [12]:
pd.Series([True,False]).all()

False

In [13]:
pd.Series([]).all()

True

In [16]:
pd.Series([np.nan]).all()

True

In [17]:
pd.Series([np.nan]).all(skipna=True) # true default

True

In [15]:
pd.Series([np.nan]).all(skipna=False)

True

# 022. pandas.DataFrame.any

In [3]:
pd.Series([False,False]).any()

False

In [4]:
pd.Series([True,False]).any()

True

In [5]:
pd.Series([]).any()

C:\Users\good-\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

False

In [6]:
pd.Series([np.nan]).any()

False

In [7]:
pd.Series([np.nan]).any(skipna=False)

True

In [8]:
df = pd.DataFrame({"A":[1,2],
                   "B":[0,2],
                   "C":[0,0]})
df

   A  B  C
0  1  0  0
1  2  2  0

In [9]:
df.any()

A     True
B     True
C    False
dtype: bool

In [10]:
df = pd.DataFrame({"A":[True, False], 
                   "B":[1,2]})
df

       A  B
0   True  1
1  False  2

In [12]:
df.any(axis='columns')

0    True
1    True
dtype: bool

In [13]:
df = pd.DataFrame({"A" : [True,False],
                   "B" : [1,0]})
df

       A  B
0   True  1
1  False  0

In [14]:
df.any(axis='columns')

0     True
1    False
dtype: bool

In [15]:
df.any(axis=None)

True

In [16]:
pd.DataFrame([]).any()

Series([], dtype: bool)

# 023. pandas.DataFrame.append

In [18]:
df = pd.DataFrame([  [1,2], [3,4]  ],
                  columns=list('AB'))
df

   A  B
0  1  2
1  3  4

In [19]:
df2 = pd.DataFrame([  [5,6], [7,8]],
                   columns=list('AB'))
df2

   A  B
0  5  6
1  7  8

In [20]:
df.append(df2, ignore_index=True)

   A  B
0  1  2
1  3  4
2  5  6
3  7  8

In [21]:
df = pd.DataFrame(columns=['A'])
for i in range(5):
    df = df.append({'A':i}, ignore_index=True)
df

   A
0  0
1  1
2  2
3  3
4  4

In [22]:
# more efficient

pd.concat([pd.DataFrame([i], columns=['A']) for i in range(5)],
          ignore_index=True)

   A
0  0
1  1
2  2
3  3
4  4

# 024. pandas.DataFrame.apply
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.apply.html

In [2]:
df = pd.DataFrame([[4,9]]*3, 
                  columns=['A','B'])
df

   A  B
0  4  9
1  4  9
2  4  9

In [3]:
df.apply(np.sqrt)

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

In [4]:
df.apply(np.sum, axis=0)

A    12
B    27
dtype: int64

In [5]:
df.apply(np.sum,axis=1)

0    13
1    13
2    13
dtype: int64

In [6]:
df.apply(lambda x: [1,2], axis=1)

0    [1, 2]
1    [1, 2]
2    [1, 2]
dtype: object

In [7]:
df.apply(lambda x : [1,2], axis=1, result_type='expand')

   0  1
0  1  2
1  1  2
2  1  2

In [8]:
df.apply(lambda x: pd.Series([1,2], index=['foo','bar']), axis=1)

   foo  bar
0    1    2
1    1    2
2    1    2

In [9]:
df.apply(lambda x: [1,2], axis=1, result_type='broadcast')

   A  B
0  1  2
1  1  2
2  1  2

# 025. pandas.DataFrame.applymap
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.applymap.html

In [1]:
import pandas as pd
import numpy as np

In [ ]:
# df = ...
# df.reset_index(drop=True)

# Etc

In [9]:
import pandas as pd
import numpy as np

In [14]:
sales = {'account' : ['Kim', 'Song', 'Noh', 'Ho'],
         'Jan' : [150, 200, 70, np.NaN],
         'Feb' : [200, 210, 90, 100],
         'Mar' : [140, np.NaN, 215, 95]}
df_orig = pd.DataFrame.from_dict(sales)
df = df_orig.copy()
df

  account    Jan  Feb    Mar
0     Kim  150.0  200  140.0
1    Song  200.0  210    NaN
2     Noh   70.0   90  215.0
3      Ho    NaN  100   95.0

### rename columns / index

In [4]:
df

  account    Jan  Feb    Mar
0     Kim  150.0  200  140.0
1    Song  200.0  210    NaN
2     Noh   70.0   90  215.0
3      Ho    NaN  100   95.0

In [5]:
df_new = df.rename(columns={'account':'name', 'Mar':'May'}, index={0:'zero'})
df_new

      name    Jan  Feb    May
zero   Kim  150.0  200  140.0
1     Song  200.0  210    NaN
2      Noh   70.0   90  215.0
3       Ho    NaN  100   95.0

### rename columns/rows of original object

In [6]:
df

  account    Jan  Feb    Mar
0     Kim  150.0  200  140.0
1    Song  200.0  210    NaN
2     Noh   70.0   90  215.0
3      Ho    NaN  100   95.0

In [7]:
df2 = df.copy()
df2

  account    Jan  Feb    Mar
0     Kim  150.0  200  140.0
1    Song  200.0  210    NaN
2     Noh   70.0   90  215.0
3      Ho    NaN  100   95.0

In [8]:
df2.rename(columns={'account':'name', 'Mar':'May'}, index={0:'zero'}, inplace=True)
df2

      name    Jan  Feb    May
zero   Kim  150.0  200  140.0
1     Song  200.0  210    NaN
2      Noh   70.0   90  215.0
3       Ho    NaN  100   95.0

### Drop Columns

#### 1. drop rows including null value

In [9]:
df

  account    Jan  Feb    Mar
0     Kim  150.0  200  140.0
1    Song  200.0  210    NaN
2     Noh   70.0   90  215.0
3      Ho    NaN  100   95.0

In [10]:
df_new2 = df.dropna(axis=0)   # drop rows which has null value
df_new2

  account    Jan  Feb    Mar
0     Kim  150.0  200  140.0
2     Noh   70.0   90  215.0

#### 2. drop columns including null value

In [11]:
df

  account    Jan  Feb    Mar
0     Kim  150.0  200  140.0
1    Song  200.0  210    NaN
2     Noh   70.0   90  215.0
3      Ho    NaN  100   95.0

In [12]:
df_new3 = df.dropna(axis=1)   # drop columns which has null value
df_new3

  account  Feb
0     Kim  200
1    Song  210
2     Noh   90
3      Ho  100

## lambda

In [15]:
df

  account    Jan  Feb    Mar
0     Kim  150.0  200  140.0
1    Song  200.0  210    NaN
2     Noh   70.0   90  215.0
3      Ho    NaN  100   95.0

#### lambda  / True/False Tag column

In [16]:
df['new_col'] = df['account'].apply(lambda x : True if (x in ['Kim','Ho']) else False)
df

  account    Jan  Feb    Mar  new_col
0     Kim  150.0  200  140.0     True
1    Song  200.0  210    NaN    False
2     Noh   70.0   90  215.0    False
3      Ho    NaN  100   95.0     True

#### lambda / testing function

In [17]:
test = lambda x : True if (x > 10 and x < 20) else False
test(12)

True

### Using if else in Lambda function
lambda (arguments) : (Return value if condition is True) if (condition) else

In [24]:
user_defined_function_01 = lambda x : True if (x>10 and x<20) else False
user_defined_function_01(17)

True

### scalar 'to_replace' and 'value'

In [2]:
import pandas as pd
s = pd.Series([0, 1, 2, 3, 4])
s.replace(0, 5)

0    5
1    1
2    2
3    3
4    4
dtype: int64

In [3]:
df = pd.DataFrame({'A': [0, 1, 2, 3, 4],
                   'B': [5, 6, 7, 8, 9],
                   'C': ['a', 'b', 'c', 'd', 'e']})
df.replace(0, 5)

   A  B  C
0  5  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

### List-like 'to_replace'

In [5]:
df.replace([0, 1, 2, 3], 4)

   A  B  C
0  4  5  a
1  4  6  b
2  4  7  c
3  4  8  d
4  4  9  e

In [6]:
df.replace([0, 1, 2, 3], [4, 3, 2, 1])

   A  B  C
0  4  5  a
1  3  6  b
2  2  7  c
3  1  8  d
4  4  9  e

In [7]:
s.replace([1, 2], method='bfill')

0    0
1    3
2    3
3    3
4    4
dtype: int64

In [9]:
df.replace({0: 10, 1: 100})

     A  B  C
0   10  5  a
1  100  6  b
2    2  7  c
3    3  8  d
4    4  9  e

### Regular expression 'to_replace'

In [10]:
df = pd.DataFrame({'A': ['bat', 'foo', 'bait'],
                   'B': ['abc', 'bar', 'xyz']})
df.replace(to_replace=r'^ba.$', value='new', regex=True)

      A    B
0   new  abc
1   foo  new
2  bait  xyz

In [11]:
df.replace({'A': r'^ba.$'}, {'A': 'new'}, regex=True)

      A    B
0   new  abc
1   foo  bar
2  bait  xyz

In [12]:
df.replace(regex=r'^ba.$', value='new')

      A    B
0   new  abc
1   foo  new
2  bait  xyz

In [13]:
df.replace(regex={r'^ba.$': 'new', 'foo': 'xyz'})

      A    B
0   new  abc
1   xyz  new
2  bait  xyz

In [14]:
df.replace(regex=[r'^ba.$', 'foo'], value='new')

      A    B
0   new  abc
1   new  new
2  bait  xyz

In [17]:
s = pd.Series([10, 'a', 'a', 'b', 'a'])
print(s)
print('-------------------------')
s.replace({'a': None})
print(s)

0    10
1     a
2     a
3     b
4     a
dtype: object
-------------------------
0    10
1     a
2     a
3     b
4     a
dtype: object

In [19]:
s = pd.Series([10, 'a', 'a', 'b', 'a'])
print(s)
print('-------------------------')
s.replace('a', None)
print(s)

0    10
1     a
2     a
3     b
4     a
dtype: object
-------------------------
0    10
1     a
2     a
3     b
4     a
dtype: object